# #循环变量-道歉次数
# n = 0
# #循环条件-道歉次数判断
# while n < 5:
#     #循环体-执行道歉
#     print('我错了')
#     #循环体发生变化-道歉次数发生变化
#     n += 1
# #道歉结束
# print('道歉结束')

#循环变量--苹果数量
apple = 1
#循环条件--吃5个
while apple <= 5:
    #判断吃到第几个苹果
    # if apple == 4:
    #     #是，吃饱了
    #     print('吃饱了')
    #     #跳出循环
    #     break
    # 判断吃到第几个苹果
    if apple == 3:
        #是，吃到虫子了
        print('有虫子')
        #拿下一个苹果，继续吃
        apple += 1
        continue
    #循环体--吃苹果
    print(f'吃第{apple}个苹果')
    #循环变量发生变化--吃的苹果数量增加
    apple += 1
#循环结束
#print('苹果吃完了')